<!-- dflook/terraform-github-actions {"workspace":"default","backend":"4904045d22707a1660f876efa13d609849082f0c2f620f23aef5ac552a7ef7de","backend_type":"s3","plan_job_ref":"Job terraform-plan-04-aws-wireguard-vpn #2 at https://github.com/pipetail/terraform/actions/runs/3107313980","plan_hash":"397986c2520a3193d0c9967d8769f154c929dc8d4d2014d4a8d378d2ad24c802","plan_text_format":"text"} -->
Terraform plan in __examples/04-aws-wireguard-vpn__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.wireguard_vpn.module.ec2_instance.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ ami                                  = "ami-05dff77713a4fa273" -> "ami-1234567890" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-west-1:175912345102:instance/i-03650feab14923dc2" -> (known after apply)
      ~ availability_zone                    = "eu-west-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "*******************" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "*********************" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-14.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.14" -> (known after apply)
      ~ public_dns                           = "ec2-63-35-162-10.eu-west-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "63.35.162.10" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "wireguard-vpn"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "*********************" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ vpn_config = <<-EOT
        // this should come right under your PrivateKey in [Interface] block
        // .3 is the first available address as of now
        Address = 10.1.0.3/32
        
        [Peer]
        PublicKey = 3I1I4p+FGkOoCjNHSmmyNDkGY8vmkSRSkg7q6DiS4go=
        AllowedIPs = 10.0.0.0/16
        Endpoint = 63.35.162.10:41194
        
    EOT -> (known after apply)
```
</details>

:memo: Plan generated in [terraform-plan-04-aws-wireguard-vpn #2](https://github.com/pipetail/terraform/actions/runs/3107313980)